---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatCoilType
source: html/1b1127c1-56aa-6338-c532-40904b878fd6.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatCoilType Property

The preheat coil type. Note this property change would reset the preheat water loop.

## Syntax (C#)
```csharp
public AirHeatingCoilType PreheatCoilType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration